The following is the Terraform plan for this changes:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudformation_stack.chatbot will be created
  + resource "aws_cloudformation_stack" "chatbot" {
      + id            = (known after apply)
      + name          = "azul-chatbot-dev"
      + outputs       = (known after apply)
      + parameters    = (known after apply)
      + policy_body   = (known after apply)
      + tags          = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "hca"
          + "component"           = "azul-chatbot"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all      = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "hca"
          + "component"           = "azul-chatbot"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + template_body = (known after apply)
    }

  # aws_iam_role.chatbot will be created
  + resource "aws_iam_role" "chatbot" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "chatbot.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "azul-chatbot-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "hca"
          + "component"           = "azul-chatbot"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all              = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "hca"
          + "component"           = "azul-chatbot"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.chatbot will be created
  + resource "aws_iam_role_policy" "chatbot" {
      + id     = (known after apply)
      + name   = "azul-chatbot-dev"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudwatch:Describe*",
                          + "cloudwatch:Get*",
                          + "cloudwatch:List*",
                          + "sns:Get*",
                          + "sns:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────


```